<a href="https://colab.research.google.com/github/manishakhadka/age_integrate_vako_backendma/blob/main/W3resource_Query_executer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import requests
from IPython.display import Markdown

In [ ]:
def exe(query):
    form_data = {
    "query": query
    }
    headers = {
        "Content-Type": "multipart/form-data"
    }
    url = "https://www.w3resource.com/sql-exercises/sql-con.php"
    response = requests.post(url, data=form_data)
    result = response.text
    return Markdown(result)

In [ ]:
exe("SELECT * FROM salesman")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>salesman_id</th><th>name</th><th>city</th><th>commission</th></tr><tr><td>5001</td><td>James Hoog</td><td>New York</td><td>0.15</td></tr>
<tr><td>5002</td><td>Nail Knite</td><td>Paris</td><td>0.13</td></tr>
<tr><td>5005</td><td>Pit Alex</td><td>London</td><td>0.11</td></tr>
<tr><td>5006</td><td>Mc Lyon</td><td>Paris</td><td>0.14</td></tr>
<tr><td>5007</td><td>Paul Adam</td><td>Rome</td><td>0.13</td></tr>
<tr><td>5003</td><td>Lauson Hen</td><td>San Jose</td><td>0.12</td></tr>
</table>

In [ ]:
#Q.No.4 From the following tables write a SQL query to find salespeople who received commissions of more than 12 percent from the company.
# Return Customer Name, customer city,
#  Salesman, commission.

# Sample table: customer

#  customer_id |   cust_name    |    city    | grade | salesman_id
# -------------+----------------+------------+-------+-------------
#         3002 | Nick Rimando   | New York   |   100 |        5001
#         3007 | Brad Davis     | New York   |   200 |        5001
#         3005 | Graham Zusi    | California |   200 |        5002
#         3008 | Julian Green   | London     |   300 |        5002
#         3004 | Fabian Johnson | Paris      |   300 |        5006
#         3009 | Geoff Cameron  | Berlin     |   100 |        5003
#         3003 | Jozy Altidor   | Moscow     |   200 |        5007
#         3001 | Brad Guzan     | London     |       |        5005
# Sample table: salesman

#  salesman_id |    name    |   city   | commission
# -------------+------------+----------+------------
#         5001 | James Hoog | New York |       0.15
#         5002 | Nail Knite | Paris    |       0.13



exe("SELECT customer.cust_name AS customername, customer.city, salesman.name AS salesman,salesman.commission FROM customer INNER JOIN salesman ON customer.salesman_id=salesman.salesman_id WHERE salesman.commission>0.12 " )

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>customername</th><th>city</th><th>salesman</th><th>commission</th></tr><tr><td>Nick Rimando</td><td>New York</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>Brad Davis</td><td>New York</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>Graham Zusi</td><td>California</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Julian Green</td><td>London</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Fabian Johnson</td><td>Paris</td><td>Mc Lyon</td><td>0.14</td></tr>
<tr><td>Jozy Altidor</td><td>Moscow</td><td>Paul Adam</td><td>0.13</td></tr>
</table>

In [ ]:
exe("SELECT customer.cust_name AS customername, customer.city, salesman.name AS salesman,salesman.commission FROM customer INNER JOIN salesman ON customer.salesman_id=salesman.salesman_id")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>customername</th><th>city</th><th>salesman</th><th>commission</th></tr><tr><td>Nick Rimando</td><td>New York</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>Brad Davis</td><td>New York</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>Graham Zusi</td><td>California</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Julian Green</td><td>London</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Fabian Johnson</td><td>Paris</td><td>Mc Lyon</td><td>0.14</td></tr>
<tr><td>Geoff Cameron</td><td>Berlin</td><td>Lauson Hen</td><td>0.12</td></tr>
<tr><td>Jozy Altidor</td><td>Moscow</td><td>Paul Adam</td><td>0.13</td></tr>
<tr><td>Brad Guzan</td><td>London</td><td>Pit Alex</td><td>0.11</td></tr>
</table>

In [ ]:
# 5. From the following tables write a SQL query to locate those salespeople who do not live in the same city where their customers live and
#  have received a commission of more than 12% from the company. Return Customer Name, customer city, Salesman, salesman city, commission.

# Sample table: customer

#  customer_id |   cust_name    |    city    | grade | salesman_id
# -------------+----------------+------------+-------+-------------
#         3002 | Nick Rimando   | New York   |   100 |        5001
#         3007 | Brad Davis     | New York   |   200 |        5001
#         3005 | Graham Zusi    | California |   200 |        5002
#         3008 | Julian Green   | London     |   300 |        5002
#         3004 | Fabian Johnson | Paris      |   300 |        5006
#         3009 | Geoff Cameron  | Berlin     |   100 |        5003
#         3003 | Jozy Altidor   | Moscow     |   200 |        5007
#         3001 | Brad Guzan     | London     |       |        5005
# Sample table: salesman

#  salesman_id |    name    |   city   | commission
# -------------+------------+----------+------------
#         5001 | James Hoog | New York |       0.15
#         5002 | Nail Knite | Paris    |       0.13


exe("SELECT a.cust_name, a.city, b.name, b.city, b.commission FROM customer a INNER JOIN salesman b ON a.salesman_id = b.salesman_id  WHERE a.city<>b.city AND b.commission  >0.12")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>cust_name</th><th>city</th><th>name</th><th>commission</th></tr><tr><td>Graham Zusi</td><td>Paris</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Julian Green</td><td>Paris</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>Jozy Altidor</td><td>Rome</td><td>Paul Adam</td><td>0.13</td></tr>
</table>

In [ ]:
# 6. From the following tables write a SQL query to find the details of an order. Return ord_no, ord_date, purch_amt, Customer Name, grade, Salesman, commission.
#  Go to the editor

# Sample table: orders

# ord_no      purch_amt   ord_date    customer_id  salesman_id
# ----------  ----------  ----------  -----------  -----------
# 70001       150.5       2012-10-05  3005         5002
# 70009       270.65      2012-09-10  3001         5005
# 70002       65.26       2012-10-05  3002         5001
# 70004       110.5       2012-08-17  3009         5003
# 70007       948.5       2012-09-10  3005         5002
# 70005       2400.6      2012-07-27  3007         5001
# 70008       5760        2012-09-10  3002         5001
# 70010       1983.43     2012-10-10  3004         5006
# 70003       2480.4      2012-10-10  3009         5003
# 70012       250.45      2012-06-27  3008         5002
# 70011       75.29       2012-08-17  3003         5007
# 70013       3045.6      2012-04-25  3002         5001
# Sample table: customer

#  customer_id |   cust_name    |    city    | grade | salesman_id
# -------------+----------------+------------+-------+-------------
#         3002 | Nick Rimando   | New York   |   100 |        5001
#         3007 | Brad Davis     | New York   |   200 |        5001
#         3005 | Graham Zusi    | California |   200 |        5002
#         3008 | Julian Green   | London     |   300 |        5002
#         3004 | Fabian Johnson | Paris      |   300 |        5006
#         3009 | Geoff Cameron  | Berlin     |   100 |        5003
#         3003 | Jozy Altidor   | Moscow     |   200 |        5007
#         3001 | Brad Guzan     | London     |       |        5005
# Sample table: salesman

#  salesman_id |    name    |   city   | commission
# -------------+------------+----------+------------
#         5001 | James Hoog | New York |       0.15
#         5002 | Nail Knite | Paris    |       0.13
#         5005 | Pit Alex   | London   |       0.11

exe("SELECT a.ord_no, a.ord_date, a.purch_Amt, b.cust_name, b.grade, c.name, c.commission FROM orders a INNER JOIN customer b ON a.customer_id=b.customer_id INNER JOIN salesman c ON a.salesman_id=c.salesman_id")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>ord_no</th><th>ord_date</th><th>purch_amt</th><th>cust_name</th><th>grade</th><th>name</th><th>commission</th></tr><tr><td>70009</td><td>2012-09-10</td><td>270.65</td><td>Brad Guzan</td><td></td><td>Pit Alex</td><td>0.11</td></tr>
<tr><td>70002</td><td>2012-10-05</td><td>65.26</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>70004</td><td>2012-08-17</td><td>110.50</td><td>Geoff Cameron</td><td>100</td><td>Lauson Hen</td><td>0.12</td></tr>
<tr><td>70005</td><td>2012-07-27</td><td>2400.60</td><td>Brad Davis</td><td>200</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>70008</td><td>2012-09-10</td><td>5760.00</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>70010</td><td>2012-10-10</td><td>1983.43</td><td>Fabian Johnson</td><td>300</td><td>Mc Lyon</td><td>0.14</td></tr>
<tr><td>70003</td><td>2012-10-10</td><td>2480.40</td><td>Geoff Cameron</td><td>100</td><td>Lauson Hen</td><td>0.12</td></tr>
<tr><td>70011</td><td>2012-08-17</td><td>75.29</td><td>Jozy Altidor</td><td>200</td><td>Paul Adam</td><td>0.13</td></tr>
<tr><td>70013</td><td>2012-04-25</td><td>3045.60</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>70001</td><td>2012-10-05</td><td>150.50</td><td>Graham Zusi</td><td>200</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>70007</td><td>2012-09-10</td><td>948.50</td><td>Graham Zusi</td><td>200</td><td>Nail Knite</td><td>0.13</td></tr>
<tr><td>70012</td><td>2012-06-27</td><td>250.45</td><td>Julian Green</td><td>300</td><td>Nail Knite</td><td>0.13</td></tr>
</table>

In [ ]:
# 7. Write a SQL statement to join the tables salesman, customer and orders so that the same column of each table appears once and only the relational rows are returned.

# Sample table: orders

# ord_no      purch_amt   ord_date    customer_id  salesman_id
# ----------  ----------  ----------  -----------  -----------
# 70001       150.5       2012-10-05  3005         5002
# 70009       270.65      2012-09-10  3001         5005
# 70002       65.26       2012-10-05  3002         5001
# 70004       110.5       2012-08-17  3009         5003
# 70007       948.5       2012-09-10  3005         5002
# 70005       2400.6      2012-07-27  3007         5001
# 70008       5760        2012-09-10  3002         5001
# 70010       1983.43     2012-10-10  3004         5006
# 70003       2480.4      2012-10-10  3009         5003
# 70012       250.45      2012-06-27  3008         5002
# 70011       75.29       2012-08-17  3003         5007
# 70013       3045.6      2012-04-25  3002         5001
# Sample table: customer

#  customer_id |   cust_name    |    city    | grade | salesman_id
# -------------+----------------+------------+-------+-------------
#         3002 | Nick Rimando   | New York   |   100 |        5001
#         3007 | Brad Davis     | New York   |   200 |        5001
#         3005 | Graham Zusi    | California |   200 |        5002
#         3008 | Julian Green   | London     |   300 |        5002
#         3004 | Fabian Johnson | Paris      |   300 |        5006


exe("SELECT * FROM orders NATURAL JOIN customer NATURAL JOIN salesman")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>salesman_id</th><th>city</th><th>customer_id</th><th>ord_no</th><th>purch_amt</th><th>ord_date</th><th>cust_name</th><th>grade</th><th>name</th><th>commission</th></tr><tr><td>5005</td><td>London</td><td>3001</td><td>70009</td><td>270.65</td><td>2012-09-10</td><td>Brad Guzan</td><td></td><td>Pit Alex</td><td>0.11</td></tr>
<tr><td>5001</td><td>New York</td><td>3002</td><td>70002</td><td>65.26</td><td>2012-10-05</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>5001</td><td>New York</td><td>3007</td><td>70005</td><td>2400.60</td><td>2012-07-27</td><td>Brad Davis</td><td>200</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>5001</td><td>New York</td><td>3002</td><td>70008</td><td>5760.00</td><td>2012-09-10</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
<tr><td>5006</td><td>Paris</td><td>3004</td><td>70010</td><td>1983.43</td><td>2012-10-10</td><td>Fabian Johnson</td><td>300</td><td>Mc Lyon</td><td>0.14</td></tr>
<tr><td>5001</td><td>New York</td><td>3002</td><td>70013</td><td>3045.60</td><td>2012-04-25</td><td>Nick Rimando</td><td>100</td><td>James Hoog</td><td>0.15</td></tr>
</table>

In [ ]:
# 4. From the following tables, write a SQL query to find all those employees who work in department ID 80 or 40. Return first name, last name, department
# number and department name.
exe("SELECT E.first_name , E.last_name, E.department_id ,  D.department_name FROM employees E JOIN departments D ON E.department_id = D.department_id AND E.department_id IN (80 , 40) ORDER BY E.last_name")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
<th>first_name</th><th>last_name</th><th>department_id</th><th>department_name</th></tr><tr><td>Ellen</td><td>Abel</td><td>80</td><td>Sales</td></tr>
<tr><td>Sundar</td><td>Ande</td><td>80</td><td>Sales</td></tr>
<tr><td>Amit</td><td>Banda</td><td>80</td><td>Sales</td></tr>
<tr><td>Elizabeth</td><td>Bates</td><td>80</td><td>Sales</td></tr>
<tr><td>David</td><td>Bernstein</td><td>80</td><td>Sales</td></tr>
<tr><td>Harrison</td><td>Bloom</td><td>80</td><td>Sales</td></tr>
<tr><td>Nanette</td><td>Cambrault</td><td>80</td><td>Sales</td></tr>
<tr><td>Gerald</td><td>Cambrault</td><td>80</td><td>Sales</td></tr>
<tr><td>Louise</td><td>Doran</td><td>80</td><td>Sales</td></tr>
<tr><td>Alberto</td><td>Errazuriz</td><td>80</td><td>Sales</td></tr>
<tr><td>Tayler</td><td>Fox</td><td>80</td><td>Sales</td></tr>
<tr><td>Danielle</td><td>Greene</td><td>80</td><td>Sales</td></tr>
<tr><td>Peter</td><td>Hall</td><td>80</td><td>Sales</td></tr>
<tr><td>Alyssa</td><td>Hutton</td><td>80</td><td>Sales</td></tr>
<tr><td>Charles</td><td>Johnson</td><td>80</td><td>Sales</td></tr>
<tr><td>Janette</td><td>King</td><td>80</td><td>Sales</td></tr>
<tr><td>Sundita</td><td>Kumar</td><td>80</td><td>Sales</td></tr>
<tr><td>David</td><td>Lee</td><td>80</td><td>Sales</td></tr>
<tr><td>Jack</td><td>Livingston</td><td>80</td><td>Sales</td></tr>
<tr><td>Mattea</td><td>Marvins</td><td>80</td><td>Sales</td></tr>
<tr><td>Susan</td><td>Mavris</td><td>40</td><td>Human Resources</td></tr>
<tr><td>Allan</td><td>McEwen</td><td>80</td><td>Sales</td></tr>
<tr><td>Christopher</td><td>Olsen</td><td>80</td><td>Sales</td></tr>
<tr><td>Lisa</td><td>Ozer</td><td>80</td><td>Sales</td></tr>
<tr><td>Karen</td><td>Partners</td><td>80</td><td>Sales</td></tr>
<tr><td>John</td><td>Russell</td><td>80</td><td>Sales</td></tr>
<tr><td>Sarath</td><td>Sewall</td><td>80</td><td>Sales</td></tr>
<tr><td>Lindsey</td><td>Smith</td><td>80</td><td>Sales</td></tr>
<tr><td>William</td><td>Smith</td><td>80</td><td>Sales</td></tr>
<tr><td>Patrick</td><td>Sully</td><td>80</td><td>Sales</td></tr>
<tr><td>Jonathon</td><td>Taylor</td><td>80</td><td>Sales</td></tr>
<tr><td>Peter</td><td>Tucker</td><td>80</td><td>Sales</td></tr>
<tr><td>Oliver</td><td>Tuvault</td><td>80</td><td>Sales</td></tr>
<tr><td>Clara</td><td>Vishney</td><td>80</td><td>Sales</td></tr>
<tr><td>Eleni</td><td>Zlotkey</td><td>80</td><td>Sales</td></tr>
</table>

In [ ]:
# # 6. From the following tables, write a SQL query to find all departments,
# including those without employees. Return first name, last name, department ID
# , dep
# # artment name.
exe("SELECT a.first_name, a.last_name, a.department_id,b.department_name FROM departments b INNER JOIN employees a ON departments.department_id")

<table id='rs_tbl' class='table table-bordered' style='display: block; overflow-x: scroll'>
<tr>
</tr></table>